const supportFilesListInternal = [
    {label: 'I1-1.内部用餐未填写完整全名清单', value: 'I1-1.内部用餐未填写完整全名清单'},
    {label: 'I1-2.未提供吃饭场景照片', value: 'I1-2.未提供吃饭场景照片'},
    {label: 'I1-3.系统金额和小票金额不一致', value: 'I1-3.系统金额和小票金额不一致'},
    {label: 'I1-4.系统填写人数和照片人数不一致', value: 'I1-4.系统填写人数和照片人数不一致'},
    {label: 'I1-5.系统填写人数和小票人数不一致', value: 'I1-5.系统填写人数和小票人数不一致'},
    {label: 'I1-6.提供的吃饭场景照片模糊不清', value: 'I1-6.提供的吃饭场景照片模糊不清'},
    {label: 'I1-7.提供的照片用餐菜品过少/无法辨别', value: 'I1-7.提供的照片用餐菜品过少/无法辨别'},
    {label: 'I1-8.实际用餐人信息有误', value: 'I1-8.实际用餐人信息有误'},
    {label: 'I1-9.水单缺少菜品明细', value: 'I1-9.水单缺少菜品明细'},
    {label: 'I1-10.系统审批人是用餐人之一', value: 'I1-10.系统审批人是用餐人之一'},
    {label: 'I1-11.小票模糊不清/无法辨别', value: 'I1-11.小票模糊不清/无法辨别'},
    {label: 'I2-1.参与者名单中存在重复的姓名和职务', value: 'I2-1.参与者名单中存在重复的姓名和职务'},
    {label: 'I2-2.酒水超标', value: 'I2-2.酒水超标'},
    {label: 'I2-3.小票中有收费不明的收费项目', value: 'I2-3.小票中有收费不明的收费项目'},
]

const supportFilesListExternal = [
    {label: 'E1-1.未提供用餐菜品照片', value: 'E1-1.未提供用餐菜品照片'},
    {label: 'E1-2.系统金额和小票金额不一致', value: 'E1-2.系统金额和小票金额不一致'},
    {label: 'E1-3.系统填写人数和小票人数不一致', value: 'E1-3.系统填写人数和小票人数不一致'},
    {label: 'E1-4.商务目的填写不完整', value: 'E1-4.商务目的填写不完整'},
    {label: 'E1-5.提供的菜品照片模糊不清', value: 'E1-5.提供的菜品照片模糊不清'},
    {label: 'E1-6.手动标记GO/Non-GO的参会者，标记信息不一致', value: 'E1-6.手动标记GO/Non-GO的参会者，标记前后不一致'},
    {label: 'E1-7.提供的照片用餐菜品过少/无法辨别', value: 'E1-7.提供的照片用餐菜品过少/无法辨别'},
    {label: 'E1-8.实际用餐人信息有误', value: 'E1-8.实际用餐人信息有误'},
    {label: 'E1-9.用餐人员Veeva系统缺少行政职务/岗位', value: 'E1-9.用餐人员Veeva系统缺少行政职务/岗位'},
    {label: 'E1-10.水单缺少菜品明细', value: 'E1-10.水单缺少菜品明细'},
    {label: 'E1-11.系统审批人是用餐人之一', value: 'E1-11.系统审批人是用餐人之一'},
    {label: 'E1-12.小票模糊不清/无法辨别', value: 'E1-12.小票模糊不清/无法辨别'},
    {label: 'E2-1.商务目的（外部用餐性质和内容）填写不合理', value: 'E2-1.商务目的（外部用餐性质和内容）填写不合理'},
    {label: 'E2-2.同一场景用餐中参与者名单中存在重复的姓名和职务', value: 'E2-2.同一场景用餐中参与者名单中存在重复的姓名和职务'},
    {label: 'E2-3.酒水超标', value: 'E2-3.酒水超标'},
    {label: 'E2-4.小票中有收费不明的项目', value: 'E2-4.小票中有收费不明的项目'},
]

const ticketReopenReason = [
    {label: '用户确认金额错误',value: '用户确认金额错误'},
    {label: '用户确认人数错误',value: '用户确认人数错误'},
    {label: '小票信息错误',value: '小票信息错误'},
    {label: '小票审批状态错误',value: '小票审批状态错误'},
]

const ticketReopenDetail: any = {
    '用户确认金额错误': [
        {label: '1.1用户确认金额和小票不一致',value: '1.1用户确认金额和小票不一致'}
    ],
    '用户确认人数错误': [
        {label: '2.1用户确认人数和小票不一致',value: '2.1用户确认人数和小票不一致'}
    ],
    '小票信息错误': [
        {label: '3.1小票实际金额错误',value: '3.1小票实际金额错误'},
        {label: '3.2小票用餐人数错误',value: '3.2小票用餐人数错误'},
        {label: '3.3小票缺少菜品明细',value: '3.3小票缺少菜品明细'},
        {label: '3.4小票无用餐人数，且未手写人数并加盖客户章',value: '3.4小票无用餐人数，且未手写人数并加盖客户章'},
        {label: '3.5小票餐厅名称与实际不符，且未手写人数并加盖客户章',value: '3.5小票餐厅名称与实际不符，且未手写人数并加盖客户章'},
        {label: '3.6小票非结账单',value: '3.6小票非结账单'},
        {label: '3.7小票菜品与实际餐品不符',value: '3.7小票菜品与实际餐品不符'},
        {label: '3.8小票照片模糊',value: '3.8小票照片模糊'},
    ],
    '小票审批状态错误': [
        {label: '4.1BDS客服误操作',value: '4.1BDS客服误操作'}
    ],
}

export {
    supportFilesListInternal,
    supportFilesListExternal,
    ticketReopenReason,
    ticketReopenDetail
}